src/DataProcessors/МониторИнцидентов/МониторИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МониторИнцидентов</name>
</mdclass:DataProcessor>

src/InformationRegisters/ИнцидентыАктивные/ИнцидентыАктивные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнцидентыАктивные</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнцидентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееСрабатывание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатываний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБаза</name>
    <comment>Инфобаза или название счетчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРеакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеОповещатьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроигнорироватьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОткрытияПовторная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатыванийПовторное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникИнцидента</name>
    <type>
      <types>CatalogRef.ОбнаружениеИнцидентовОперативное</types>
      <types>String</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
      <types>CatalogRef.ГруппыСчетчиков</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеНавигационнойСсылкиИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОбъектыБлокировок/ОбъектыБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыБлокировок</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/МониторИнцидентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДлительнаяОперацияВФоне(ПараметрыЗапуска) Экспорт
    
    КлючОбъекта = ПараметрыЗапуска.ПараметрыХранилищаНастроек.КлючОбъекта;
    КлючНастроек = ПараметрыЗапуска.ПараметрыХранилищаНастроек.КлючНастроек;
    Пользователь = ПараметрыЗапуска.ПараметрыХранилищаНастроек.Пользователь;
    
    ДанныеХранилища = Новый Соответствие;
    ДанныеХранилища.Вставить("ВыполнятьДо", ТекущаяУниверсальнаяДата());
    ДанныеХранилища.Вставить("Данные", Неопределено);
    
    СохранитьВХранилище(КлючОбъекта, КлючНастроек, ДанныеХранилища, Пользователь);
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   ИнцидентыАктивные.ТипИнцидента КАК ТипИнцидента,
    |   Инциденты.УровеньИнцидента КАК УровеньИнцидента,
    |   КОЛИЧЕСТВО(*) КАК КоличествоИнцидентов
    |ИЗ
    |   РегистрСведений.ИнцидентыАктивные КАК ИнцидентыАктивные
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   РегистрСведений.Инциденты КАК Инциденты
    |ПО
    |   Инциденты.ТипИнцидента = ИнцидентыАктивные.ТипИнцидента
    |   И Инциденты.Инцидент = ИнцидентыАктивные.Инцидент
    |СГРУППИРОВАТЬ ПО
    |   ИнцидентыАктивные.ТипИнцидента,
    |   Инциденты.УровеньИнцидента
    |";
    
    Выполнять = Истина;
    
    Пока Выполнять Цикл
        
        Результат = Запрос.Выполнить();
        
        Данные = Новый Соответствие;
        Данные.Вставить(Перечисления.УровниИнцидентов.КритическаяОшибка, Новый Соответствие);
        Данные.Вставить(Перечисления.УровниИнцидентов.Ошибка, Новый Соответствие);
        Данные.Вставить(Перечисления.УровниИнцидентов.Предупреждение, Новый Соответствие);
                
        Выборка = Результат.Выбрать();
        Пока Выборка.Следующий() Цикл
            
            ДанныеУровень = Данные[Выборка.УровеньИнцидента];
            
            ДанныеТипаИнцидента = ДанныеУровень[Выборка.ТипИнцидента];
            Если ДанныеТипаИнцидента = Неопределено Тогда
                ДанныеТипаИнцидента = Новый Соответствие;
                ДанныеУровень.Вставить(Выборка.ТипИнцидента, ДанныеТипаИнцидента);
            КонецЕсли;
            
            ДанныеТипаИнцидента.Вставить("Количество", Выборка.КоличествоИнцидентов);
            
        КонецЦикла;
        
        
        ДанныеХранилища.Вставить("Данные", Данные);
        СохранитьВХранилище(КлючОбъекта, КлючНастроек, ДанныеХранилища, Пользователь);
        
        КипВнешнийКомпонент.Пауза(5000);
        
        ДанныеХранилища = ЗагрузитьИзХранилища(КлючОбъекта, КлючНастроек, Пользователь);
        Выполнять = ДанныеХранилища["ВыполнятьДо"] > ТекущаяУниверсальнаяДата(); 
        
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьВХранилище(КлючОбъекта, КлючНастроек, ДанныеХранилища,Пользователь)
    
    Попытка
        
        НачатьТранзакцию();
        
        БлокировкаДанных = Новый БлокировкаДанных;
        ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
        ЭлементБлокировки.УстановитьЗначение("Объект", КлючОбъекта+КлючНастроек+Пользователь);
        БлокировкаДанных.Заблокировать();
        
        ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ДанныеХранилища,,Пользователь);
        
        ЗафиксироватьТранзакцию();
        
    Исключение
        
        ОтменитьТранзакцию();
        ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        
    КонецПопытки;
    
КонецПроцедуры

Функция ЗагрузитьИзХранилища(КлючОбъекта, КлючНастроек, Пользователь)
    
    ДанныеХранилища = Неопределено;
    
    Попытка
        
        НачатьТранзакцию();
        
        БлокировкаДанных = Новый БлокировкаДанных;
        ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
        ЭлементБлокировки.УстановитьЗначение("Объект", КлючОбъекта+КлючНастроек+Пользователь);
        БлокировкаДанных.Заблокировать();
        
        ДанныеХранилища = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек,,Пользователь);
        
        ЗафиксироватьТранзакцию();
        
    Исключение
        
        ОтменитьТранзакцию();
        ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        
    КонецПопытки;
    
    Возврат ДанныеХранилища;
    
КонецФункции


#КонецОбласти

#КонецЕсли
